Arcueid-creater/ros2-control-dmboard/BalanceInfantry_Course/Document/SVD/SVD/STM32U59x.svd
        <register>
          <name>GPDMA_C15LLR</name>
          <displayName>GPDMA_C15LLR</displayName>
          <description>GPDMA channel x linked-list address register</description>
          <addressOffset>0x84C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LA</name>
              <description>pointer (16-bit low significant address) to the next linked-list data structure If UT1=UT2=UB1=USA=UDA=ULL=0 and if LA[15:2]=0: the current LLI is the last one. The channel transfer is completed without any update of the linked-list DMA register file. Else, this field is the pointer to the memory address offset from which the next linked-list data structure will be automatically fetched from, once the data transfer is completed, in order to conditionally update the linked-list DMA internal register file i.e. possibly GPDMA_CxCTR1, GPDMA_CxTR2, GPDMA_CxBR1, GPDMA_CxSAR, GPDMA_CxDAR and GPDMA_CxLLR. Note: The user should program the pointer to be 32-bit aligned. The two low significant bits are write ignored.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>ULL</name>
              <description>Update GPDMA_CxLLR from memory This bit controls the update of the GPDMA_CxLLR register from the memory during the link transfer. - 0: no GPDMA_CxLLR update - 1: GPDMA_CxLLR update</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UB2</name>
              <description>Update GPDMA_CxBR2 from memory This bit controls the update of the GPDMA_CxBR2 register from the memory during the link transfer. - 0: no GPDMA_CxBR2 update - 1: GPDMA_CxBR2 update</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UT3</name>
              <description>Update GPDMA_CxTR3 from memory This bit controls the update of the GPDMA_CxTR3 register from the memory during the link transfer. - 0: no GPDMA_CxTR3 update - 1: GPDMA_CxTR3 update</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UDA</name>
              <description>Update GPDMA_CxDAR from memory This bit controls the update of the GPDMA_CxDAR register from the memory during the link transfer. - 0: no GPDMA_CxDAR update - 1: GPDMA_CxDAR update</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USA</name>
              <description>Update GPDMA_CxSAR from memory This bit controls the update of the GPDMA_CxSAR register from the memory during the link transfer. - 0: no GPDMA_CxSAR update - 1: GPDMA_CxSAR update</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UB1</name>
              <description>Update GPDMA_CxBR1 from memory This bit controls the update of the GPDMA_CxBR1 register from the memory during the link transfer. If UB1=0 and if GPDMA_CxLLR != 0, the linked-list is not completed. Then GPDMA_CxBR1.BNDT[15:0] is restored to the programmed value after data transfer is completed and before the link transfer. - 0: no GPDMA_CxBR1 update (GPDMA_CxBR1.BNDT[15:0] is restored, if any link transfer) - 1: GPDMA_CxBR1 update</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UT2</name>
              <description>Update GPDMA_CxTR2 from memory This bit controls the update of the GPDMA_CxTR2 register from the memory during the link transfer. - 0: no GPDMA_CxTR2 update - 1: GPDMA_CxTR2 update</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UT1</name>
              <description>Update GPDMA_CxTR1 from memory This bit controls the update of the GPDMA_CxTR1 register from the memory during the link transfer. - 0: no GPDMA_CxTR1 update - 1: GPDMA_CxTR1 update</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C4LBAR</name>
          <displayName>GPDMA_C4LBAR</displayName>
          <description>channel x linked-list base address register</description>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LBA</name>
              <description>linked-list base address of DMA channel x</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C5LBAR</name>
          <displayName>GPDMA_C5LBAR</displayName>
          <description>channel x linked-list base address register</description>
          <addressOffset>0x2D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LBA</name>
              <description>linked-list base address of DMA channel x</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C6LBAR</name>
          <displayName>GPDMA_C6LBAR</displayName>
          <description>channel x linked-list base address register</description>
          <addressOffset>0x350</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LBA</name>
              <description>linked-list base address of DMA channel x</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C7LBAR</name>
          <displayName>GPDMA_C7LBAR</displayName>
          <description>channel x linked-list base address register</description>
          <addressOffset>0x3D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LBA</name>
              <description>linked-list base address of DMA channel x</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C8LBAR</name>
          <displayName>GPDMA_C8LBAR</displayName>
          <description>channel x linked-list base address register</description>
          <addressOffset>0x450</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LBA</name>
              <description>linked-list base address of DMA channel x</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C9LBAR</name>
          <displayName>GPDMA_C9LBAR</displayName>
          <description>channel x linked-list base address register</description>
          <addressOffset>0x4D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LBA</name>
              <description>linked-list base address of DMA channel x</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C10LBAR</name>
          <displayName>GPDMA_C10LBAR</displayName>
          <description>channel x linked-list base address register</description>
          <addressOffset>0x550</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LBA</name>
              <description>linked-list base address of DMA channel x</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C11LBAR</name>
          <displayName>GPDMA_C11LBAR</displayName>
          <description>channel x linked-list base address register</description>
          <addressOffset>0x5D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LBA</name>
              <description>linked-list base address of DMA channel x</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C12LBAR</name>
          <displayName>GPDMA_C12LBAR</displayName>
          <description>channel x linked-list base address register</description>
          <addressOffset>0x650</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LBA</name>
              <description>linked-list base address of DMA channel x</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C13LBAR</name>
          <displayName>GPDMA_C13LBAR</displayName>
          <description>channel x linked-list base address register</description>
          <addressOffset>0x6D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LBA</name>
              <description>linked-list base address of DMA channel x</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C14LBAR</name>
          <displayName>GPDMA_C14LBAR</displayName>
          <description>channel x linked-list base address register</description>
          <addressOffset>0x750</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LBA</name>
              <description>linked-list base address of DMA channel x</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C15LBAR</name>
          <displayName>GPDMA_C15LBAR</displayName>
          <description>channel x linked-list base address register</description>
          <addressOffset>0x7D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LBA</name>
              <description>linked-list base address of DMA channel x</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C4FCR</name>
          <displayName>GPDMA_C4FCR</displayName>
          <description>GPDMA channel x flag clear register</description>
          <addressOffset>0x25C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCF</name>
              <description>transfer complete flag clear - 0: no effect - 1: clears the corresponding TCF flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTF</name>
              <description>half transfer flag clear - 0: no effect - 1: clears the corresponding HTF flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTEF</name>
              <description>data transfer error flag clear - 0: no effect - 1: clears the corresponding DTEF flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULEF</name>
              <description>update link transfer error flag clear - 0: no effect - 1: clears the corresponding ULEF flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USEF</name>
              <description>user setting error flag clear - 0: no effect - 1: clears the corresponding USEF flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSPF</name>
              <description>completed suspension flag clear - 0: no effect - 1: clears the corresponding SUSPF flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOF</name>
              <description>trigger overrun flag clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C5FCR</name>
          <displayName>GPDMA_C5FCR</displayName>
          <description>GPDMA channel x flag clear register</description>
          <addressOffset>0x2DC</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCF</name>
              <description>transfer complete flag clear - 0: no effect - 1: clears the corresponding TCF flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTF</name>
              <description>half transfer flag clear - 0: no effect - 1: clears the corresponding HTF flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTEF</name>
              <description>data transfer error flag clear - 0: no effect - 1: clears the corresponding DTEF flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULEF</name>
              <description>update link transfer error flag clear - 0: no effect - 1: clears the corresponding ULEF flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USEF</name>
              <description>user setting error flag clear - 0: no effect - 1: clears the corresponding USEF flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSPF</name>
              <description>completed suspension flag clear - 0: no effect - 1: clears the corresponding SUSPF flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOF</name>
              <description>trigger overrun flag clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C6FCR</name>
          <displayName>GPDMA_C6FCR</displayName>
          <description>GPDMA channel x flag clear register</description>
          <addressOffset>0x35C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCF</name>
              <description>transfer complete flag clear - 0: no effect - 1: clears the corresponding TCF flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTF</name>
              <description>half transfer flag clear - 0: no effect - 1: clears the corresponding HTF flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTEF</name>
              <description>data transfer error flag clear - 0: no effect - 1: clears the corresponding DTEF flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULEF</name>
              <description>update link transfer error flag clear - 0: no effect - 1: clears the corresponding ULEF flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USEF</name>
              <description>user setting error flag clear - 0: no effect - 1: clears the corresponding USEF flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSPF</name>
              <description>completed suspension flag clear - 0: no effect - 1: clears the corresponding SUSPF flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOF</name>
              <description>trigger overrun flag clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C7FCR</name>
          <displayName>GPDMA_C7FCR</displayName>
          <description>GPDMA channel x flag clear register</description>
          <addressOffset>0x3DC</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCF</name>
              <description>transfer complete flag clear - 0: no effect - 1: clears the corresponding TCF flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTF</name>
              <description>half transfer flag clear - 0: no effect - 1: clears the corresponding HTF flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTEF</name>
              <description>data transfer error flag clear - 0: no effect - 1: clears the corresponding DTEF flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULEF</name>
              <description>update link transfer error flag clear - 0: no effect - 1: clears the corresponding ULEF flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USEF</name>
              <description>user setting error flag clear - 0: no effect - 1: clears the corresponding USEF flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSPF</name>
              <description>completed suspension flag clear - 0: no effect - 1: clears the corresponding SUSPF flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOF</name>
              <description>trigger overrun flag clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
