Arcueid-creater/ros2-control-dmboard/BalanceInfantry_Course/Document/SVD/SVD/STM32U59x.svd
        <register>
          <name>HCSPLT0</name>
          <displayName>HCSPLT0</displayName>
          <description>OTG host channel 0 split control register</description>
          <addressOffset>0x504</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRTADDR</name>
              <description>Port address
			This field is the port number of the recipient transaction translator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HUBADDR</name>
              <description>Hub address
			This field holds the device address of the transaction translatorâs hub.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XACTPOS</name>
              <description>Transaction position
			This field is used to determine whether to send all, first, middle, or last payloads with each OUT transaction.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>All. This is the entire data payload of this transaction (which is less than or equal to 188 bytes)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>Begin. This is the first data payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Mid. This is the middle payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>End. This is the last payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPLSPLT</name>
              <description>Do complete split
			The application sets this bit to request the OTG host to perform a complete split transaction.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLITEN</name>
              <description>Split enable
			The application sets this bit to indicate that this channel is enabled to perform split transactions.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCSPLT1</name>
          <displayName>HCSPLT1</displayName>
          <description>OTG host channel 1 split control register</description>
          <addressOffset>0x524</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRTADDR</name>
              <description>Port address
			This field is the port number of the recipient transaction translator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HUBADDR</name>
              <description>Hub address
			This field holds the device address of the transaction translatorâs hub.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XACTPOS</name>
              <description>Transaction position
			This field is used to determine whether to send all, first, middle, or last payloads with each OUT transaction.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>All. This is the entire data payload of this transaction (which is less than or equal to 188 bytes)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>Begin. This is the first data payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Mid. This is the middle payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>End. This is the last payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPLSPLT</name>
              <description>Do complete split
			The application sets this bit to request the OTG host to perform a complete split transaction.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLITEN</name>
              <description>Split enable
			The application sets this bit to indicate that this channel is enabled to perform split transactions.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCSPLT2</name>
          <displayName>HCSPLT2</displayName>
          <description>OTG host channel 2 split control register</description>
          <addressOffset>0x544</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRTADDR</name>
              <description>Port address
			This field is the port number of the recipient transaction translator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HUBADDR</name>
              <description>Hub address
			This field holds the device address of the transaction translatorâs hub.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XACTPOS</name>
              <description>Transaction position
			This field is used to determine whether to send all, first, middle, or last payloads with each OUT transaction.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>All. This is the entire data payload of this transaction (which is less than or equal to 188 bytes)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>Begin. This is the first data payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Mid. This is the middle payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>End. This is the last payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPLSPLT</name>
              <description>Do complete split
			The application sets this bit to request the OTG host to perform a complete split transaction.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLITEN</name>
              <description>Split enable
			The application sets this bit to indicate that this channel is enabled to perform split transactions.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCSPLT3</name>
          <displayName>HCSPLT3</displayName>
          <description>OTG host channel 3 split control register</description>
          <addressOffset>0x564</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRTADDR</name>
              <description>Port address
			This field is the port number of the recipient transaction translator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HUBADDR</name>
              <description>Hub address
			This field holds the device address of the transaction translatorâs hub.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XACTPOS</name>
              <description>Transaction position
			This field is used to determine whether to send all, first, middle, or last payloads with each OUT transaction.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>All. This is the entire data payload of this transaction (which is less than or equal to 188 bytes)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>Begin. This is the first data payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Mid. This is the middle payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>End. This is the last payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPLSPLT</name>
              <description>Do complete split
			The application sets this bit to request the OTG host to perform a complete split transaction.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLITEN</name>
              <description>Split enable
			The application sets this bit to indicate that this channel is enabled to perform split transactions.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCSPLT4</name>
          <displayName>HCSPLT4</displayName>
          <description>OTG host channel 4 split control register</description>
          <addressOffset>0x584</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRTADDR</name>
              <description>Port address
			This field is the port number of the recipient transaction translator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HUBADDR</name>
              <description>Hub address
			This field holds the device address of the transaction translatorâs hub.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XACTPOS</name>
              <description>Transaction position
			This field is used to determine whether to send all, first, middle, or last payloads with each OUT transaction.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>All. This is the entire data payload of this transaction (which is less than or equal to 188 bytes)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>Begin. This is the first data payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Mid. This is the middle payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>End. This is the last payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPLSPLT</name>
              <description>Do complete split
			The application sets this bit to request the OTG host to perform a complete split transaction.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLITEN</name>
              <description>Split enable
			The application sets this bit to indicate that this channel is enabled to perform split transactions.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCSPLT5</name>
          <displayName>HCSPLT5</displayName>
          <description>OTG host channel 5 split control register</description>
          <addressOffset>0x5A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRTADDR</name>
              <description>Port address
			This field is the port number of the recipient transaction translator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HUBADDR</name>
              <description>Hub address
			This field holds the device address of the transaction translatorâs hub.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XACTPOS</name>
              <description>Transaction position
			This field is used to determine whether to send all, first, middle, or last payloads with each OUT transaction.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>All. This is the entire data payload of this transaction (which is less than or equal to 188 bytes)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>Begin. This is the first data payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Mid. This is the middle payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>End. This is the last payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPLSPLT</name>
              <description>Do complete split
			The application sets this bit to request the OTG host to perform a complete split transaction.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLITEN</name>
              <description>Split enable
			The application sets this bit to indicate that this channel is enabled to perform split transactions.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCSPLT6</name>
          <displayName>HCSPLT6</displayName>
          <description>OTG host channel 6 split control register</description>
          <addressOffset>0x5C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRTADDR</name>
              <description>Port address
			This field is the port number of the recipient transaction translator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HUBADDR</name>
              <description>Hub address
			This field holds the device address of the transaction translatorâs hub.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XACTPOS</name>
              <description>Transaction position
			This field is used to determine whether to send all, first, middle, or last payloads with each OUT transaction.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>All. This is the entire data payload of this transaction (which is less than or equal to 188 bytes)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>Begin. This is the first data payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Mid. This is the middle payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>End. This is the last payload of this transaction (which is larger than 188 bytes)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPLSPLT</name>
              <description>Do complete split
			The application sets this bit to request the OTG host to perform a complete split transaction.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLITEN</name>
              <description>Split enable
			The application sets this bit to indicate that this channel is enabled to perform split transactions.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
